_Rarzrabotki/Kazna/InformationRegisters/ДатаПоследовательностиКассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ДатаПоследовательностиКассы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОстаткиСтоимостиКассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/CommonModules/ДопМодуль/Ext/Module.bsl
Функция ПроверитьПолныеПрава(Пользователь) Экспорт
	ВыбПользователь = Пользователь.Наименование;
	РольДляПроверки = Метаданные.Роли.ПолныеПрава;
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ВыбПользователь);
	//ПользовательИБ.Роли.Содержит(РольДляПроверки)
	Если ПользовательИБ = неопределено тогда
		Возврат Ложь;
	иначе
		Возврат ПользовательИБ.Роли.Содержит(РольДляПроверки);//ПользователиИнформационнойБазы.НайтиПоИмени(Пользователь).Роли.Содержит(Метаданные.Роли.ПолныеПрава)
	КонецЕсли;
	
КонецФункции

Функция ПроверитьОтветственного(Ответственный)Экспорт  
	Если Пользователи.ТекущийПользователь().Наименование  = Ответственный.Наименование  
		ИЛИ Пользователи.ТекущийПользователь().Наименование = "cfo"  Тогда  
		Возврат Ложь 
	Иначе
		Возврат Истина
	КонецЕсли;
КонецФункции

Процедура ОбновитьПоследовательностьКассы(Документ) Экспорт 
	
	ТекущаяДата = Документ.Дата;
    // Проверка и обновление регистра последовательности
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |   ДатаПоследовательностиКассы.Документ КАК Документ,
    |   ДатаПоследовательностиКассы.Дата КАК Дата
    |ИЗ
    |   РегистрСведений.ДатаПоследовательностиКассы КАК ДатаПоследовательностиКассы";
    
    Результат = Запрос.Выполнить();
    НужноОбновить = Ложь;
    
    Если Результат.Пустой() Тогда
        // Нет записи в регистре, создаем новую
        НужноОбновить = Истина;
    Иначе
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        ДатаВРегистре = Выборка.Дата;
        
        Если ТекущаяДата < ДатаВРегистре Тогда
            // Дата документа меньше, обновляем регистр
            НужноОбновить = Истина;
        ИначеЕсли ТекущаяДата > ДатаВРегистре Тогда
            // Проверяем, есть ли документы между датой в регистре и текущей датой
            ЗапросПроверка = Новый Запрос;
            ЗапросПроверка.Текст = 
            "ВЫБРАТЬ ПЕРВЫЕ 1
            |	ПКО.Ссылка
            |ИЗ
            |	Документ.ПриходныйКассовыйОрдер КАК ПКО
            |ГДЕ
            |	ПКО.Дата > &ДатаВРегистре
            |	И ПКО.Дата < &ТекущаяДата
            |	И ПКО.Проведен
            |
            |ОБЪЕДИНИТЬ ВСЕ
            |
            |ВЫБРАТЬ ПЕРВЫЕ 1
            |	РКО.Ссылка
            |ИЗ
            |	Документ.РасходныйКассовыйОрдер КАК РКО
            |ГДЕ
            |	РКО.Дата > &ДатаВРегистре
            |	И РКО.Дата < &ТекущаяДата
            |	И РКО.Проведен";
            
            ЗапросПроверка.УстановитьПараметр("ДатаВРегистре", ДатаВРегистре);
            ЗапросПроверка.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
            
            Если ЗапросПроверка.Выполнить().Пустой() Тогда
                // Нет документов между датами, обновляем регистр
                НужноОбновить = Истина;
            КонецЕсли;
        КонецЕсли;
    КонецЕсли;
    
    Если НужноОбновить Тогда
        // Очищаем регистр и записываем новую точку последовательности
        НаборЗаписей = РегистрыСведений.ДатаПоследовательностиКассы.СоздатьНаборЗаписей();
        НаборЗаписей.Записать(Истина); // Удаляем существующий запись
        
        НовыйЗапись = НаборЗаписей.Добавить();
        НовыйЗапись.Документ = Документ;
        НовыйЗапись.Дата = ТекущаяДата;
        НаборЗаписей.Записать(Истина);
    КонецЕсли;
КонецПроцедуры
